IdeaRS.OpenModel.Detail.ReinfBarByPolyline
Representing reinforcement bar input by polyline in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.ReinfBarByPolyline.#ctor
Constructor

IdeaRS.OpenModel.Detail.ReinfBarByPolyline.MasterComponent
Master component of reinforcement

IdeaRS.OpenModel.Detail.ReinfBarByPolyline.MasterPoint
Master point of reinforcement

IdeaRS.OpenModel.Detail.ReinfBarByPolyline.BarShape
Polyline representing shape of bar

IdeaRS.OpenModel.Detail.ReinfBarByPolyline.BarDistance
Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment

IdeaRS.OpenModel.Detail.ReinfBarByPolyline.NumOfLayers
Number of layers

IdeaRS.OpenModel.Detail.ReinfBarByPolyline.Distance
Distance between reinforcement layers

IdeaRS.OpenModel.Detail.ReinfBarByPolyline.Position
Offset between master point and first point of BarShape